LuckkMaker/apm32-ceedling-example/svd/APM32F40x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>RNG</name>
            <description>Random number generator</description>
            <groupName>RNG</groupName>
            <baseAddress>0x50060800</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>FPU</name>
                <description>FPU interrupt</description>
                <value>81</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>INTEN</name>
                            <description>Interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>RNGEN</name>
                            <description>Random number generator enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>status register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>FSINT</name>
                            <description>Seed error interrupt status</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>CLKERINT</name>
                            <description>Clock error interrupt status</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>FSCSTS</name>
                            <description>Seed error current status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>CLKERCSTS</name>
                            <description>Clock error current status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>DATARDY</name>
                            <description>Data ready</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATA</name>
                    <displayName>DATA</displayName>
                    <description>data register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>Random data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>DCI</name>
            <description>Digital camera interface</description>
            <groupName>DCI</groupName>
            <baseAddress>0x50050000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DCI</name>
                <description>DCI global interrupt</description>
                <value>78</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>control register 1</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>DCIEN</name>
                            <description>DCI enable</description>
                            <bitOffset>14</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EXDMOD</name>
                            <description>Extended data mode</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>FCRCFG</name>
                            <description>Frame capture rate control</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>VSYNCPOL</name>
                            <description>Vertical synchronization polarity</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSYNCPOL</name>
                            <description>Horizontal synchronization polarity</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PXCLKPOL</name>
                            <description>Pixel clock polarity</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ESYNCSEL</name>
                            <description>Embedded synchronization select</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>JPGFM</name>
                            <description>JPEG format</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CROPF</name>
                            <description>Crop feature</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CMODE</name>
                            <description>Capture mode</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CEN</name>
                            <description>Capture enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>status register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>FIFONEMP</name>
                            <description>FIFO not empty</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VSYNCSTS</name>
                            <description>VSYNCSTS</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HSYNCSTS</name>
                            <description>HSYNCSTS</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RINTSTS</name>
                    <displayName>RINTSTS</displayName>
                    <description>raw interrupt status register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>LINE_RINT</name>
                            <description>Line raw interrupt status</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VSYNC_RINT</name>
                            <description>VSYNC raw interrupt status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SYNCERR_RINT</name>
                            <description>Synchronization error raw interrupt status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OVR_RINT</name>
                            <description>Overrun raw interrupt
              status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC_RINT</name>
                            <description>Capture complete raw interrupt
              status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTEN</name>
                    <displayName>INTEN</displayName>
                    <description>interrupt enable register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>LINEINTEN</name>
                            <description>Line interrupt enable</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VSYNCINTEN</name>
                            <description>VSYNC interrupt enable</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SYNCERRINTEN</name>
                            <description>Synchronization error interrupt
              enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OVRINTEN</name>
                            <description>Overrun interrupt enable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CCINTEN</name>
                            <description>Capture complete interrupt enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>MINTSTS</name>
                    <displayName>MINTSTS</displayName>
                    <description>masked interrupt status register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>LINE_MINT</name>
                            <description>Line masked interrupt status</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VSYNC_MINT</name>
                            <description>VSYNC masked interrupt status</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SYNCERR_MINT</name>
                            <description>Synchronization error masked interrupt status</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OVR_MINT</name>
                            <description>Overrun masked interrupt status</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC_MINT</name>
                            <description>Capture complete masked interrupt status</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>INTCLR</name>
                    <displayName>INTCLR</displayName>
                    <description>interrupt clear register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>LINE_INTCLR</name>
                            <description>line interrupt status clear</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>VSYNC_INTCLR</name>
                            <description>Vertical synch interrupt status clear</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SYNCERR_INTCLR</name>
                            <description>Synchronization error interrupt status clear</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>OVR_INTCLR</name>
                            <description>Overrun interrupt status clear</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CC_INTCLR</name>
                            <description>Capture complete interrupt status clear</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ESYNCC</name>
                    <displayName>ESYNCC</displayName>
                    <description>embedded synchronization code register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>FEDC</name>
                            <description>Frame end delimiter code</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>LEDC</name>
                            <description>Line end delimiter code</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>LSDC</name>
                            <description>Line start delimiter code</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>FSDC</name>
                            <description>Frame start delimiter code</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>ESYNCUM</name>
                    <displayName>ESYNCUM</displayName>
                    <description>embedded synchronization unmask register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>FEDUM</name>
                            <description>Frame end delimiter unmask</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>LEDUM</name>
                            <description>Line end delimiter unmask</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>LSDUM</name>
                            <description>Line start delimiter unmask</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>FSDUM</name>
                            <description>Frame start delimiter unmask</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CROPWSTAT</name>
                    <displayName>CROPWSTAT</displayName>
                    <description>crop window start</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>VSLINECNT</name>
                            <description>Vertical start line count</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>13</bitWidth>
                        </field>
                        <field>
                            <name>HOFSCNT</name>
                            <description>Horizontal offset count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CROPWSIZE</name>
                    <displayName>CROPWSIZE</displayName>
                    <description>crop window size</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>VLINECNT</name>
                            <description>Vertical line count</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                        <field>
                            <name>CCNT</name>
                            <description>Capture count</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>14</bitWidth>
                        </field>
                    </fields>
                </register>
