LuckkMaker/apm32-ceedling-example/svd/APM32F40x.svd
                <register>
                    <name>DATA</name>
                    <displayName>DATA</displayName>
                    <description>data register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x0000</resetValue>
                    <fields>
                        <field>
                            <name>DATA3</name>
                            <description>Data byte 3</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA2</name>
                            <description>Data byte 2</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA1</name>
                            <description>Data byte 1</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATA0</name>
                            <description>Data byte 0</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>DMA2</name>
            <description>DMA controller</description>
            <groupName>DMA</groupName>
            <baseAddress>0x40026400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>DMA2_STR0</name>
                <description>DMA2 Stream 0 global interrupt</description>
                <value>56</value>
            </interrupt>
            <interrupt>
                <name>DMA2_STR1</name>
                <description>DMA2 Stream 1 global interrupt</description>
                <value>57</value>
            </interrupt>
            <interrupt>
                <name>DMA2_STR2</name>
                <description>DMA2 Stream 2 global interrupt</description>
                <value>58</value>
            </interrupt>
            <interrupt>
                <name>DMA2_STR3</name>
                <description>DMA2 Stream 3 global interrupt</description>
                <value>59</value>
            </interrupt>
            <interrupt>
                <name>DMA2_STR4</name>
                <description>DMA2 Stream 4 global interrupt</description>
                <value>60</value>
            </interrupt>
            <interrupt>
                <name>DMA2_STR5</name>
                <description>DMA2 Stream 5 global interrupt</description>
                <value>68</value>
            </interrupt>
            <interrupt>
                <name>DMA2_STR6</name>
                <description>DMA2 Stream 6 global interrupt</description>
                <value>69</value>
            </interrupt>
            <interrupt>
                <name>DMA2_STR7</name>
                <description>DMA2 Stream 7 global interrupt</description>
                <value>70</value>
            </interrupt>
            <registers>
                <register>
                    <name>LINTSTS</name>
                    <displayName>LINTSTS</displayName>
                    <description>low interrupt status register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXCIFLG3</name>
                            <description>Stream x transfer complete interrupt
              flag (x = 3..0)</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIFLG3</name>
                            <description>Stream x half transfer interrupt flag
              (x=3..0)</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEIFLG3</name>
                            <description>Stream x transfer error interrupt flag
              (x=3..0)</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMEIFLG3</name>
                            <description>Stream x direct mode error interrupt
              flag (x=3..0)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEIFLG3</name>
                            <description>Stream x FIFO error interrupt flag
              (x=3..0)</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIFLG2</name>
                            <description>Stream x transfer complete interrupt
              flag (x = 3..0)</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIFLG2</name>
                            <description>Stream x half transfer interrupt flag
              (x=3..0)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEIFLG2</name>
                            <description>Stream x transfer error interrupt flag
              (x=3..0)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMEIFLG2</name>
                            <description>Stream x direct mode error interrupt
              flag (x=3..0)</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEIFLG2</name>
                            <description>Stream x FIFO error interrupt flag
              (x=3..0)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIFLG1</name>
                            <description>Stream x transfer complete interrupt
              flag (x = 3..0)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIFLG1</name>
                            <description>Stream x half transfer interrupt flag
              (x=3..0)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEIFLG1</name>
                            <description>Stream x transfer error interrupt flag
              (x=3..0)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMEIFLG1</name>
                            <description>Stream x direct mode error interrupt
              flag (x=3..0)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEIFLG1</name>
                            <description>Stream x FIFO error interrupt flag
              (x=3..0)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIFLG0</name>
                            <description>Stream x transfer complete interrupt
              flag (x = 3..0)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIFLG0</name>
                            <description>Stream x half transfer interrupt flag
              (x=3..0)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEIFLG0</name>
                            <description>Stream x transfer error interrupt flag
              (x=3..0)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMEIFLG0</name>
                            <description>Stream x direct mode error interrupt
              flag (x=3..0)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEIFLG0</name>
                            <description>Stream x FIFO error interrupt flag
              (x=3..0)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>HINTSTS</name>
                    <displayName>HINTSTS</displayName>
                    <description>high interrupt status register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>TXCIFLG7</name>
                            <description>Stream x transfer complete interrupt
              flag (x=7..4)</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIFLG7</name>
                            <description>Stream x half transfer interrupt flag
              (x=7..4)</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEIFLG7</name>
                            <description>Stream x transfer error interrupt flag
              (x=7..4)</description>
                            <bitOffset>25</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMEIFLG7</name>
                            <description>Stream x direct mode error interrupt
              flag (x=7..4)</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEIFLG7</name>
                            <description>Stream x FIFO error interrupt flag
              (x=7..4)</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIFLG6</name>
                            <description>Stream x transfer complete interrupt
              flag (x=7..4)</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIFLG6</name>
                            <description>Stream x half transfer interrupt flag
              (x=7..4)</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEIFLG6</name>
                            <description>Stream x transfer error interrupt flag
              (x=7..4)</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMEIFLG6</name>
                            <description>Stream x direct mode error interrupt
              flag (x=7..4)</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEIFLG6</name>
                            <description>Stream x FIFO error interrupt flag
              (x=7..4)</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIFLG5</name>
                            <description>Stream x transfer complete interrupt
              flag (x=7..4)</description>
                            <bitOffset>11</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIFLG5</name>
                            <description>Stream x half transfer interrupt flag
              (x=7..4)</description>
                            <bitOffset>10</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEIFLG5</name>
                            <description>Stream x transfer error interrupt flag
              (x=7..4)</description>
                            <bitOffset>9</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMEIFLG5</name>
                            <description>Stream x direct mode error interrupt
              flag (x=7..4)</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEIFLG5</name>
                            <description>Stream x FIFO error interrupt flag
              (x=7..4)</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXCIFLG4</name>
                            <description>Stream x transfer complete interrupt
              flag (x=7..4)</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>HTXIFLG4</name>
                            <description>Stream x half transfer interrupt flag
              (x=7..4)</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TXEIFLG4</name>
                            <description>Stream x transfer error interrupt flag
              (x=7..4)</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMEIFLG4</name>
                            <description>Stream x direct mode error interrupt
              flag (x=7..4)</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>FEIFLG4</name>
                            <description>Stream x FIFO error interrupt flag
              (x=7..4)</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
