LuckkMaker/apm32-ceedling-example/svd/APM32F40x.svd
            </registers>
        </peripheral>
        <peripheral derivedFrom="USART6">
            <name>USART1</name>
            <baseAddress>0x40011000</baseAddress>
            <interrupt>
                <name>USART1</name>
                <description>USART1 global interrupt</description>
                <value>37</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="USART6">
            <name>USART2</name>
            <baseAddress>0x40004400</baseAddress>
            <interrupt>
                <name>USART2</name>
                <description>USART2 global interrupt</description>
                <value>38</value>
            </interrupt>
        </peripheral>
        <peripheral derivedFrom="USART6">
            <name>USART3</name>
            <baseAddress>0x40004800</baseAddress>
            <interrupt>
                <name>USART3</name>
                <description>USART3 global interrupt</description>
                <value>39</value>
            </interrupt>
        </peripheral>
        <peripheral>
            <name>DAC</name>
            <description>Digital-to-analog converter</description>
            <groupName>DAC</groupName>
            <baseAddress>0x40007400</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>TMR6_DAC</name>
                <description>TMR6 global interrupt, DAC1 and DAC2 underrun
error interrupt</description>
                <value>54</value>
            </interrupt>
            <registers>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>control register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAUDIEN2</name>
                            <description>DAC channel2 DMA underrun interrupt
              enable</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAENCH2</name>
                            <description>DAC channel2 DMA enable</description>
                            <bitOffset>28</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MAMPSELCH2</name>
                            <description>DAC channel2 mask/amplitude
              selector</description>
                            <bitOffset>24</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>WAVENCH2</name>
                            <description>DAC channel2 noise/triangle wave
              generation enable</description>
                            <bitOffset>22</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TRGSELCH2</name>
                            <description>DAC channel2 trigger
              selection</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TRGENCH2</name>
                            <description>DAC channel2 trigger
              enable</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BUFFDCH2</name>
                            <description>DAC channel2 output buffer
              disable</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENCH2</name>
                            <description>DAC channel2 enable</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAUDIEN1</name>
                            <description>DAC channel1 DMA Underrun Interrupt
              enable</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAENCH1</name>
                            <description>DAC channel1 DMA enable</description>
                            <bitOffset>12</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>MAMPSELCH1</name>
                            <description>DAC channel1 mask/amplitude
              selector</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>WAVENCH1</name>
                            <description>DAC channel1 noise/triangle wave
              generation enable</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                        <field>
                            <name>TRGSELCH1</name>
                            <description>DAC channel1 trigger
              selection</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>TRGENCH1</name>
                            <description>DAC channel1 trigger
              enable</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BUFFDCH1</name>
                            <description>DAC channel1 output buffer
              disable</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ENCH1</name>
                            <description>DAC channel1 enable</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SWTRG</name>
                    <displayName>SWTRG</displayName>
                    <description>software trigger register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SWTRG2</name>
                            <description>DAC channel2 software
              trigger</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SWTRG1</name>
                            <description>DAC channel1 software
              trigger</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DH12R1</name>
                    <displayName>DH12R1</displayName>
                    <description>channel1 12-bit right-aligned data holding
          register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DAC channel1 12-bit right-aligned
              data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DH12L1</name>
                    <displayName>DH12L1</displayName>
                    <description>channel1 12-bit left aligned data holding
          register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DAC channel1 12-bit left-aligned
              data</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DH8R1</name>
                    <displayName>DH8R1</displayName>
                    <description>channel1 8-bit right aligned data holding
          register</description>
                    <addressOffset>0x10</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DAC channel1 8-bit right-aligned
              data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DH12R2</name>
                    <displayName>DH12R2</displayName>
                    <description>channel2 12-bit right aligned data holding
          register</description>
                    <addressOffset>0x14</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DAC channel2 12-bit right-aligned
              data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DH12L2</name>
                    <displayName>DH12L2</displayName>
                    <description>channel2 12-bit left aligned data holding
          register</description>
                    <addressOffset>0x18</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DAC channel2 12-bit left-aligned
              data</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DH8R2</name>
                    <displayName>DH8R2</displayName>
                    <description>channel2 8-bit right-aligned data holding
          register</description>
                    <addressOffset>0x1C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DAC channel2 8-bit right-aligned
              data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DH12RDUAL</name>
                    <displayName>DH12RDUAL</displayName>
                    <description>Dual DAC 12-bit right-aligned data holding
          register</description>
                    <addressOffset>0x20</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATACH2</name>
                            <description>DAC channel2 12-bit right-aligned
              data</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>DATACH1</name>
                            <description>DAC channel1 12-bit right-aligned
              data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DH12LDUAL</name>
                    <displayName>DH12LDUAL</displayName>
                    <description>DUAL DAC 12-bit left aligned data holding
          register</description>
                    <addressOffset>0x24</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATACH2</name>
                            <description>DAC channel2 12-bit left-aligned
              data</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                        <field>
                            <name>DATACH1</name>
                            <description>DAC channel1 12-bit left-aligned
              data</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DH8RDUAL</name>
                    <displayName>DH8RDUAL</displayName>
                    <description>DUAL DAC 8-bit right aligned data holding
          register</description>
                    <addressOffset>0x28</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATACH2</name>
                            <description>DAC channel2 8-bit right-aligned
              data</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>DATACH1</name>
                            <description>DAC channel1 8-bit right-aligned
              data</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATAOCH1</name>
                    <displayName>DATAOCH1</displayName>
                    <description>channel1 data output register</description>
                    <addressOffset>0x2C</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DAC channel1 data output</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DATAOCH2</name>
                    <displayName>DATAOCH2</displayName>
                    <description>channel2 data output register</description>
                    <addressOffset>0x30</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DATA</name>
                            <description>DAC channel2 data output</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>12</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>status register</description>
                    <addressOffset>0x34</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DMAUDFLG2</name>
                            <description>DAC channel2 DMA underrun
              flag</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>DMAUDFLG1</name>
                            <description>DAC channel1 DMA underrun
              flag</description>
                            <bitOffset>13</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
