LuckkMaker/apm32-ceedling-example/svd/APM32F40x.svd
                <register>
                    <name>DIEPINT7</name>
                    <displayName>DIEPINT7</displayName>
                    <description>OTG device endpoint-7 interrupt
          register</description>
                    <addressOffset>0x1E8</addressOffset>
                    <size>32</size>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>TSFCMP</name>
                            <description>Transfer completed
              interrupt</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disabled
              interrupt</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TO</name>
                            <description>Timeout condition</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>ITXEMP</name>
                            <description>IN token received when TxFIFO is
              empty</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>IEPNAKE</name>
                            <description>IN endpoint NAK effective</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>TXFE</name>
                            <description>Transmit FIFO empty</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTRS0</name>
                    <displayName>DIEPTRS0</displayName>
                    <description>OTG_HS device IN endpoint 0 transfer size
          register</description>
                    <addressOffset>0x110</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPDMA_DOEPDMA1</name>
                    <displayName>DIEPDMA_DOEPDMA1</displayName>
                    <description>OTG_HS device endpoint-1 DMA address
          register</description>
                    <addressOffset>0x114</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPDMA_DOEPDMA2</name>
                    <displayName>DIEPDMA_DOEPDMA2</displayName>
                    <description>OTG_HS device endpoint-2 DMA address
          register</description>
                    <addressOffset>0x134</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPDMA_DOEPDMA3</name>
                    <displayName>DIEPDMA_DOEPDMA3</displayName>
                    <description>OTG_HS device endpoint-3 DMA address
          register</description>
                    <addressOffset>0x154</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPDMA_DOEPDMA4</name>
                    <displayName>DIEPDMA_DOEPDMA4</displayName>
                    <description>OTG_HS device endpoint-4 DMA address
          register</description>
                    <addressOffset>0x174</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPDMA_DOEPDMA5</name>
                    <displayName>DIEPDMA_DOEPDMA5</displayName>
                    <description>OTG_HS device endpoint-5 DMA address
          register</description>
                    <addressOffset>0x194</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>DMAADDR</name>
                            <description>DMA address</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DITXFSTS0</name>
                    <displayName>DITXFSTS0</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO
          status register</description>
                    <addressOffset>0x118</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFSASEL</name>
                            <description>IN endpoint TxFIFO space
              avail</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DITXFSTS1</name>
                    <displayName>DITXFSTS1</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO
          status register</description>
                    <addressOffset>0x138</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFSASEL</name>
                            <description>IN endpoint TxFIFO space
              avail</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DITXFSTS2</name>
                    <displayName>DITXFSTS2</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO
          status register</description>
                    <addressOffset>0x158</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFSASEL</name>
                            <description>IN endpoint TxFIFO space
              avail</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DITXFSTS3</name>
                    <displayName>DITXFSTS3</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO
          status register</description>
                    <addressOffset>0x178</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFSASEL</name>
                            <description>IN endpoint TxFIFO space
              avail</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DITXFSTS4</name>
                    <displayName>DITXFSTS4</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO
          status register</description>
                    <addressOffset>0x198</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFSASEL</name>
                            <description>IN endpoint TxFIFO space
              avail</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DITXFSTS5</name>
                    <displayName>DITXFSTS5</displayName>
                    <description>OTG_HS device IN endpoint transmit FIFO
          status register</description>
                    <addressOffset>0x1B8</addressOffset>
                    <size>32</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>INEPTXFSASEL</name>
                            <description>IN endpoint TxFIFO space
              avail</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTRS1</name>
                    <displayName>DIEPTRS1</displayName>
                    <description>OTG_HS device endpoint transfer size
          register</description>
                    <addressOffset>0x130</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TXDSEL</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTRS2</name>
                    <displayName>DIEPTRS2</displayName>
                    <description>OTG_HS device endpoint transfer size
          register</description>
                    <addressOffset>0x150</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TXDSEL</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTRS3</name>
                    <displayName>DIEPTRS3</displayName>
                    <description>OTG_HS device endpoint transfer size
          register</description>
                    <addressOffset>0x170</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TXDSEL</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTRS4</name>
                    <displayName>DIEPTRS4</displayName>
                    <description>OTG_HS device endpoint transfer size
          register</description>
                    <addressOffset>0x190</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TXDSEL</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DIEPTRS5</name>
                    <displayName>DIEPTRS5</displayName>
                    <description>OTG_HS device endpoint transfer size
          register</description>
                    <addressOffset>0x1B0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>EPTRS</name>
                            <description>Transfer size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>19</bitWidth>
                        </field>
                        <field>
                            <name>EPPCNT</name>
                            <description>Packet count</description>
                            <bitOffset>19</bitOffset>
                            <bitWidth>10</bitWidth>
                        </field>
                        <field>
                            <name>TXDSEL</name>
                            <description>Multi count</description>
                            <bitOffset>29</bitOffset>
                            <bitWidth>2</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>DOEPCTRL0</name>
                    <displayName>DOEPCTRL0</displayName>
                    <description>OTG_HS device control OUT endpoint 0 control
          register</description>
                    <addressOffset>0x300</addressOffset>
                    <size>32</size>
                    <resetValue>0x00008000</resetValue>
                    <fields>
                        <field>
                            <name>MAXPS</name>
                            <description>Maximum packet size</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>USBAEP</name>
                            <description>USB active endpoint</description>
                            <bitOffset>15</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>NAKSTSTCFG</name>
                            <description>NAK status</description>
                            <bitOffset>17</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPTYPE</name>
                            <description>Endpoint type</description>
                            <bitOffset>18</bitOffset>
                            <bitWidth>2</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>SNMEN</name>
                            <description>Snoop mode</description>
                            <bitOffset>20</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>STALLH</name>
                            <description>STALL handshake</description>
                            <bitOffset>21</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>NAKCLR</name>
                            <description>Clear NAK</description>
                            <bitOffset>26</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>NAKSET</name>
                            <description>Set NAK</description>
                            <bitOffset>27</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>EPDIS</name>
                            <description>Endpoint disable</description>
                            <bitOffset>30</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>EPEN</name>
                            <description>Endpoint enable</description>
                            <bitOffset>31</bitOffset>
                            <bitWidth>1</bitWidth>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
