LuckkMaker/apm32-ceedling-example/svd/APM32F40x.svd
            </registers>
        </peripheral>
        <peripheral>
            <name>OTG_HS1_PWRCLK</name>
            <description>USB on the go high speed</description>
            <groupName>USB_OTG_HS</groupName>
            <baseAddress>0x40040E00</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x3F200</size>
                <usage>registers</usage>
            </addressBlock>
            <registers>
                <register>
                    <name>PCGCTRL</name>
                    <displayName>PCGCTRL</displayName>
                    <description>Power and clock gating control
          register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>32</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <fields>
                        <field>
                            <name>PCLKSTOP</name>
                            <description>Stop PHY clock</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>GCLK</name>
                            <description>Gate HCLK</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>PHYSUS</name>
                            <description>PHY suspended</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
            </registers>
        </peripheral>
        <peripheral>
            <name>BN</name>
            <description>Big number</description>
            <groupName>BN</groupName>
            <baseAddress>0x500A0000</baseAddress>
            <addressBlock>
                <offset>0x0</offset>
                <size>0x400</size>
                <usage>registers</usage>
            </addressBlock>
            <interrupt>
                <name>BN</name>
                <description>BN global
        interrupt</description>
                <value>84</value>
            </interrupt>
            <registers>
                <register>
                    <name>REV</name>
                    <displayName>REV</displayName>
                    <description>Revision Register</description>
                    <addressOffset>0x0</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>MIN</name>
                            <description>Minor revision.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>MID</name>
                            <description>Middle revision.</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                        <field>
                            <name>MAJ</name>
                            <description>Major revision.</description>
                            <bitOffset>16</bitOffset>
                            <bitWidth>8</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>CTRL</name>
                    <displayName>CTRL</displayName>
                    <description>control register</description>
                    <addressOffset>0x4</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>START</name>
                            <description>Start a new operation.</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>SP</name>
                            <description>Security parameter</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>3</bitWidth>
                        </field>
                        <field>
                            <name>SELECT</name>
                            <description>Select</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                        <field>
                            <name>IE</name>
                            <description>Interrupt</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>STS</name>
                    <displayName>STS</displayName>
                    <description>status register</description>
                    <addressOffset>0x8</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>DONE</name>
                            <description>Operation is done</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BUSY</name>
                            <description>Operation is done</description>
                            <bitOffset>1</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>CB</name>
                            <description>Carry out or borrow in</description>
                            <bitOffset>2</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>TR</name>
                            <description>Test result</description>
                            <bitOffset>3</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>INF</name>
                            <description>Infinity point</description>
                            <bitOffset>4</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>EVEN</name>
                            <description>Modulo even</description>
                            <bitOffset>5</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ZERO</name>
                            <description>B/K/M zero</description>
                            <bitOffset>6</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>ATTACKED</name>
                            <description>Attacked</description>
                            <bitOffset>7</bitOffset>
                            <bitWidth>1</bitWidth>
                        </field>
                        <field>
                            <name>BLEN</name>
                            <description>Bit length</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>16</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>WID</name>
                    <displayName>WID</displayName>
                    <description>Operand Width register</description>
                    <addressOffset>0xC</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PWID</name>
                            <description>ECPM P width</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>7</bitWidth>
                        </field>
                        <field>
                            <name>KWID</name>
                            <description>ECPM key width</description>
                            <bitOffset>8</bitOffset>
                            <bitWidth>4</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>P</name>
                    <displayName>P</displayName>
                    <description>P/M register</description>
                    <addressOffset>0x40</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>P_REG</name>
                            <description>Write modulus P/M into IP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>A</name>
                    <displayName>A</displayName>
                    <description>BN Operand/EC Parameter A register</description>
                    <addressOffset>0x44</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>A_REG</name>
                            <description>Write operand A or ECC parameter A into IP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>B</name>
                    <displayName>B</displayName>
                    <description>BN Operand/EC Parameter B register</description>
                    <addressOffset>0x48</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>B_REG</name>
                            <description>Write operand B or ECC parameter B into IP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>K</name>
                    <displayName>K</displayName>
                    <description>ECC Key register</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>K_REG</name>
                            <description>Write ECC key into IP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PX</name>
                    <displayName>PX</displayName>
                    <description>ECC x coordinate of Point P</description>
                    <addressOffset>0x50</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PX_REG</name>
                            <description>Write x coordinate of point P into IP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PY</name>
                    <displayName>PY</displayName>
                    <description>ECC y coordinate of Point P</description>
                    <addressOffset>0x54</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>PY_REG</name>
                            <description>Write y coordinate of point P into IP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SX</name>
                    <displayName>SX</displayName>
                    <description>ECC x coordinate of Point S</description>
                    <addressOffset>0x58</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SX_REG</name>
                            <description>Write x coordinate of point S into IP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>SY</name>
                    <displayName>SY</displayName>
                    <description>ECC y coordinate of Point S</description>
                    <addressOffset>0x5C</addressOffset>
                    <size>0x20</size>
                    <access>read-write</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>SY_REG</name>
                            <description>Write y coordinate of point S into IP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RX</name>
                    <displayName>RX</displayName>
                    <description>ECC x coordinate of Point R</description>
                    <addressOffset>0x60</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RX_REG</name>
                            <description>Read BN result R or ECC result x coordinate of
point R from IP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RY</name>
                    <displayName>RY</displayName>
                    <description>ECC y coordinate of Point R</description>
                    <addressOffset>0x64</addressOffset>
                    <size>0x20</size>
                    <access>read-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RY_REG</name>
                            <description>Read ECC result y coordinate of point R from IP</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>RND</name>
                    <displayName>RND</displayName>
                    <description>Random number register</description>
                    <addressOffset>0x68</addressOffset>
                    <size>0x20</size>
                    <access>write-only</access>
                    <resetValue>0x00000000</resetValue>
                    <fields>
                        <field>
                            <name>RND_REG</name>
                            <description>Write a true random number to it</description>
                            <bitOffset>0</bitOffset>
                            <bitWidth>32</bitWidth>
                        </field>
                    </fields>
                </register>
